# -------------------------------------------------------------
# 문제 1
# -------------------------------------------------------------
# 1-1
data = 'kim1234@naver.com'
print(data[:7])
# 1-2
data = r'http://www.naver.com'
print(data[11:])
# 1-3
data = '홍길동'
print(data[1:])
# 1-4
data = 'AaBbCcDdEeFfGgHhIiJjKkLlMmNnOoPpQqRr'
print(data[0::2])
print(data[1::2])
# 1-5
data = 'ABC1DEF2GHI3JKL4MNO5PQR6STU7VWX8YZ'
print(data[3::4])
# 1-6
data = '881120-1068234'
print(data[:6])
print(data[7:])
print()

# -------------------------------------------------------------
# 문제 2
# -------------------------------------------------------------
number = int(input("정수 입력 : "))
print(f'10진수 {number}')
print(f'16진수 {hex(number)}')
print(f'8진수  {oct(number)}')
print(f'2진수  {bin(number)}')
print()

# -------------------------------------------------------------
# 문제 3
# -------------------------------------------------------------
word1 = input("첫번째 단어 입력: ")
word2 = input("두번째 단어 입력: ")
word3 = input("세번째 단어 입력: ")

print("코드 값이 가장 큰 단어  :", max(word1, word2,word3))
print("코드 값이 가장 작은 단어 :", min(word1, word2,word3))
print()

# -------------------------------------------------------------
# 문제 4
# -------------------------------------------------------------
msg = '오늘은 행복한 목요일입니다.'
finding = input("단어 입력 : ")
print(f"'{finding}'단어 메시지 존재 여부 : {finding in msg}")
print()

# -------------------------------------------------------------
# 문제 5
# -------------------------------------------------------------
word = 'zoo'
print(bin(ord(word[0])), bin(ord(word[1])), bin(ord(word[2])))